In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("customers.csv")
data1 = pd.read_csv("customers.csv")
data

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [4]:
data.shape

(5, 4)

In [5]:
data.head()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [6]:
data.head(3)

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN

In [7]:
data.tail()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [8]:
data.tail(3)

   CustomerID     Name   Age     City
2           3  Charlie  35.0      NaN
3           4    David   NaN  Chicago
4           5      Eve  45.0  Houston

In [44]:
data['Age'].max()

45.0

In [45]:
data['Age'].min()

25.0

In [9]:
data[data['Age'] == data['Age'].max()]

   CustomerID Name   Age     City
4           5  Eve  45.0  Houston

In [10]:
data.columns

Index(['CustomerID', 'Name', 'Age', 'City'], dtype='object')

In [11]:
data.isnull()

   CustomerID   Name    Age   City
0       False  False  False  False
1       False  False  False  False
2       False  False  False   True
3       False  False   True  False
4       False  False  False  False

In [12]:
new_data = data1.fillna(0, inplace = True)
# new_data
data1

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0            0
3           4    David   0.0      Chicago
4           5      Eve  45.0      Houston

In [13]:
new_data = data.dropna(axis = 0)
new_data

   CustomerID   Name   Age         City
0           1  Alice  25.0     New York
1           2    Bob  30.0  Los Angeles
4           5    Eve  45.0      Houston

In [14]:
new_data = data.dropna(axis = 1)
new_data

   CustomerID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
3           4    David
4           5      Eve

In [15]:
new_data = data.interpolate
new_data

<bound method NDFrame.interpolate of    CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston>

In [16]:
new_data = data.fillna(data['Age'].mean())
new_data

   CustomerID     Name    Age         City
0           1    Alice  25.00     New York
1           2      Bob  30.00  Los Angeles
2           3  Charlie  35.00        33.75
3           4    David  33.75      Chicago
4           5      Eve  45.00      Houston

In [42]:
new_data=data.fillna(method='ffill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_413936\126269373.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='ffill')

               Name   Age         City  nums
CustomerID
1             Alice  25.0     New York  26.0
2               Bob  30.0  Los Angeles  32.0
3           Charlie  35.0  Los Angeles  38.0
4             David  35.0      Chicago  38.0
5               Eve  45.0      Houston  50.0

In [43]:
new_data=data.fillna(method='bfill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_413936\1407429032.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='bfill')

               Name   Age         City  nums
CustomerID
1             Alice  25.0     New York  26.0
2               Bob  30.0  Los Angeles  32.0
3           Charlie  35.0      Chicago  38.0
4             David  45.0      Chicago  50.0
5               Eve  45.0      Houston  50.0

In [17]:
data['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [18]:
data[['Name', 'City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie          NaN
3    David      Chicago
4      Eve      Houston

In [19]:
type[data['Name']]

type[0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object]

In [20]:
data.loc()

In [21]:
data['nums'] = data['CustomerID'] + data['Age']
data

   CustomerID     Name   Age         City  nums
0           1    Alice  25.0     New York  26.0
1           2      Bob  30.0  Los Angeles  32.0
2           3  Charlie  35.0          NaN  38.0
3           4    David   NaN      Chicago   NaN
4           5      Eve  45.0      Houston  50.0

In [22]:
bins = pd.cut(data['Age'], bins=[25, 35, 45], labels=['Low', 'High'])
bins

0     NaN
1     Low
2     Low
3     NaN
4    High
Name: Age, dtype: category
Categories (2, object): ['Low' < 'High']

In [23]:
pd.get_dummies(data['Name'])

   Alice    Bob  Charlie  David    Eve
0   True  False    False  False  False
1  False   True    False  False  False
2  False  False     True  False  False
3  False  False    False   True  False
4  False  False    False  False   True

In [24]:
data.groupby('City')['Age'].sum()

City
Chicago         0.0
Houston        45.0
Los Angeles    30.0
New York       25.0
Name: Age, dtype: float64

In [25]:
data.agg({'Age' : 'mean', 'CustomerID' : 'sum'})

Age           33.75
CustomerID    15.00
dtype: float64

In [26]:
data.pivot_table(values='Age', index='Name', aggfunc='sum')

          Age
Name
Alice    25.0
Bob      30.0
Charlie  35.0
David     0.0
Eve      45.0

In [27]:
orders = pd.read_csv('orders.csv')
orders

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0     NaN  2024-12-23
4      105         NaN  150.75  2024-12-24

In [28]:
pd.merge(data, orders, on='CustomerID', how='inner')

   CustomerID     Name   Age         City  nums  OrderID  Amount   OrderDate
0           1    Alice  25.0     New York  26.0      101   250.5  2024-12-20
1           2      Bob  30.0  Los Angeles  32.0      102   120.0  2024-12-21
2           3  Charlie  35.0          NaN  38.0      103   320.0  2024-12-22
3           4    David   NaN      Chicago   NaN      104     NaN  2024-12-23

In [29]:
data.set_index('CustomerID', inplace=True)
orders.set_index('CustomerID', inplace=True)
data.join(orders, how = 'left')

               Name   Age         City  nums  OrderID  Amount   OrderDate
CustomerID
1.0           Alice  25.0     New York  26.0    101.0   250.5  2024-12-20
2.0             Bob  30.0  Los Angeles  32.0    102.0   120.0  2024-12-21
3.0         Charlie  35.0          NaN  38.0    103.0   320.0  2024-12-22
4.0           David   NaN      Chicago   NaN    104.0     NaN  2024-12-23
5.0             Eve  45.0      Houston  50.0      NaN     NaN         NaN

In [30]:
pd.concat([data, orders])

               Name   Age         City  nums  OrderID  Amount   OrderDate
CustomerID
1.0           Alice  25.0     New York  26.0      NaN     NaN         NaN
2.0             Bob  30.0  Los Angeles  32.0      NaN     NaN         NaN
3.0         Charlie  35.0          NaN  38.0      NaN     NaN         NaN
4.0           David   NaN      Chicago   NaN      NaN     NaN         NaN
5.0             Eve  45.0      Houston  50.0      NaN     NaN         NaN
1.0             NaN   NaN          NaN   NaN    101.0  250.50  2024-12-20
2.0             NaN   NaN          NaN   NaN    102.0  120.00  2024-12-21
3.0             NaN   NaN          NaN   NaN    103.0  320.00  2024-12-22
4.0             NaN   NaN          NaN   NaN    104.0     NaN  2024-12-23
NaN             NaN   NaN          NaN   NaN    105.0  150.75  2024-12-24

In [31]:
data.replace({26, 27})

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_413936\75188990.py:1: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  data.replace({26, 27})

               Name   Age         City  nums
CustomerID
1             Alice  25.0     New York  26.0
2               Bob  30.0  Los Angeles  32.0
3           Charlie  35.0          NaN  38.0
4             David   NaN      Chicago   NaN
5               Eve  45.0      Houston  50.0

In [32]:
data.apply(lambda x: x.strip() if isinstance(x, str) else x)

               Name   Age         City  nums
CustomerID
1             Alice  25.0     New York  26.0
2               Bob  30.0  Los Angeles  32.0
3           Charlie  35.0          NaN  38.0
4             David   NaN      Chicago   NaN
5               Eve  45.0      Houston  50.0

In [33]:
data.drop_duplicates()

               Name   Age         City  nums
CustomerID
1             Alice  25.0     New York  26.0
2               Bob  30.0  Los Angeles  32.0
3           Charlie  35.0          NaN  38.0
4             David   NaN      Chicago   NaN
5               Eve  45.0      Houston  50.0

In [34]:
# data.pivot(index = 'CustomerID', columns = 'Name', values = 'Age')

In [35]:
# data.melt(id_vars=['CustomerID'], value_vars=['Age', 'Name'])

In [36]:
data.describe()

             Age       nums
count   4.000000   4.000000
mean   33.750000  36.500000
std     8.539126  10.246951
min    25.000000  26.000000
25%    28.750000  30.500000
50%    32.500000  35.000000
75%    37.500000  41.000000
max    45.000000  50.000000

In [37]:
# data.corr()

In [38]:
data['Name'].value_counts()

Name
Alice      1
Bob        1
Charlie    1
David      1
Eve        1
Name: count, dtype: int64

In [39]:
new_data = (data['Age'] - data['Age'].mean()) / data['Age'].std()
new_data

CustomerID
1   -1.024695
2   -0.439155
3    0.146385
4         NaN
5    1.317465
Name: Age, dtype: float64

In [40]:
new_data = data['Age'].apply(np.log1p)
new_data

CustomerID
1    3.258097
2    3.433987
3    3.583519
4         NaN
5    3.828641
Name: Age, dtype: float64

In [41]:
data.to_csv('modified_customers.csv')